USE travelogicdb;

INSERT INTO tbl_option (product_code, reservation_date, adult_count, child_count) VALUES
(76, '2023-05-20', 2, 0),
(76, '2023-05-20', 2, 3),
(76, '2023-05-20', 1, 1),
(76, '2023-05-20', 1, 1),
(76, '2023-05-20', 1, 1),
(70, '2023-04-28', 1, 1);

INSERT INTO tbl_option (product_code, reservation_date, adult_count, child_count) VALUES
(144, '2023-08-29', 1, 1),
(70, '2023-09-29', 1, 1),
(102, '2023-10-29', 1, 1),
# 10
(79, '2023-11-29', 1, 1),
(79, '2023-11-29', 1, 1),
(79, '2024-03-29', 1, 1),
(70, '2024-04-29', 1, 1),
(76, '2024-04-29', 1, 1),
(70, '2024-05-29', 1, 1),
# 16
(70, '2024-06-29', 1, 1);

INSERT INTO tbl_option (product_code, reservation_date, adult_count, child_count) VALUES
(63, '2024-05-09', 3, 2),
(50, '2024-05-09', 2, 1),
(76, '2024-06-09', 4, 0),
#20
(63, '2024-10-09', 2, 2),
(76, '2024-11-09', 1, 3),
(63, '2024-12-09', 2, 0),
(50, '2024-12-09', 5, 1),
(144, '2024-10-09', 1, 0),
(50, '2024-10-24', 2, 0),
#26
(49, '2025-01-09', 3, 2),
(49, '2025-02-17', 3, 2),
(35, '2025-08-17', 3, 2),
(153, '2025-06-17', 3, 2),
(35, '2025-06-24', 3, 2),
#31
(35, '2025-05-02', 3, 2),
(76, '2025-05-09', 3, 2),
(144, '2025-10-08', 3, 2),
(153, '2025-11-09', 3, 2),
(76, '2025-12-09', 3, 2),
#36
(60, '2026-02-23', 3, 2),
(60, '2026-03-23', 3, 2),
(60, '2026-01-13', 3, 2),
(60, '2026-02-03', 3, 2),
(76, '2026-02-23', 3, 2),
#41
(153, '2026-01-23', 3, 2),
(60, '2026-07-23', 3, 2),
(60, '2026-04-23', 3, 2),
(19, '2026-06-23', 3, 2),
(153, '2026-05-23', 3, 2),
#46
(19, '2026-04-23', 3, 2),
(60, '2026-04-23', 3, 2),
(60, '2025-08-02', 3, 2),
(153, '2025-09-01', 3, 2),
(144, '2025-10-09', 4, 0);

INSERT INTO tbl_order (product_code, option_code, member_code, booking_uid, order_adult_price, order_child_price, total_price, order_date, order_status, is_reviewed) VALUES
(76, 1, 2, 'RSV20250401-01', 120000, NULL, 240000, '2023-04-01 10:23:45', 'COMPLETED', 1),
(76, 2, 3, 'RSV20250401-02', 80000, 50000, 310000, '2023-04-02 14:10:12', 'COMPLETED', 1),
(76, 3, 4, 'RSV20250401-03', 80000, 50000, 130000, '2023-04-03 09:05:33', 'COMPLETED', 1),
(76, 4, 5, 'RSV20250401-04', 80000, 50000, 130000, '2023-04-03 10:05:33', 'COMPLETED', 1),
(76, 5, 6, 'RSV20250401-05', 80000, 50000, 130000, '2023-04-04 12:05:33', 'COMPLETED', 1),
(70, 6, 6, 'RSV20250401-06', 80000, 50000, 130000, '2023-04-06 12:05:33', 'COMPLETED', 0);

INSERT INTO tbl_order (product_code, option_code, member_code, booking_uid, order_adult_price, order_child_price, total_price, order_date, order_status, is_reviewed) VALUES
(144, 7, 4, 'RSV20250401-07', 80000, 50000, 130000, '2023-04-06 12:05:33', 'COMPLETED', 0),
(70, 8, 4, 'RSV20250401-08', 80000, 50000, 130000, '2023-04-07 17:05:33', 'COMPLETED', 1),
(102, 9, 4, 'RSV20250401-09', 80000, 50000, 130000, '2023-04-08 12:05:33', 'COMPLETED', 1),
# 10
(79, 10, 4, 'RSV20250401-10', 80000, 50000, 130000, '2023-04-09 12:05:33', 'COMPLETED', 0),
(79, 11, 5, 'RSV20250401-11', 80000, 50000, 130000, '2023-04-10 12:05:33', 'COMPLETED', 1),
(79, 12, 6, 'RSV20250401-12', 80000, 50000, 130000, '2023-04-11 12:05:33', 'COMPLETED', 1),
(70, 13, 5, 'RSV20250401-13', 80000, 50000, 130000, '2024-04-12 12:05:33', 'CANCELED', 0),
(79, 14, 2, 'RSV20250401-14', 80000, 50000, 130000, '2024-04-13 12:05:33', 'COMPLETED', 1),
(70, 15, 4, 'RSV20250401-15', 80000, 50000, 130000, '2024-04-14 12:05:33', 'COMPLETED', 0),
#16
(70, 16, 3, 'RSV20250401-16', 80000, 50000, 130000, '2024-04-26 12:05:33', 'COMPLETED', 0),
(63, 17, 4, 'RSV20250401-17', 80000, 50000, 130000, '2024-04-24 12:05:33', 'COMPLETED', 0),
(50, 18, 4, 'RSV20250401-18', 80000, 50000, 130000, '2024-04-25 12:05:33', 'COMPLETED', 0),
(76, 19, 4, 'RSV20250401-19', 80000, 50000, 130000, '2024-04-26 12:05:33', 'COMPLETED', 1),
(63, 20, 4, 'RSV20250401-20', 80000, 50000, 130000, '2024-04-27 12:05:33', 'COMPLETED', 0),
#21
(76, 21, 5, 'RSV20250401-21', 80000, 50000, 130000, '2024-04-28 12:05:33', 'COMPLETED', 0),
(63, 22, 5, 'RSV20250401-22', 80000, 50000, 130000, '2024-04-29 12:05:33', 'COMPLETED', 0),
(50, 23, 5, 'RSV20250401-23', 80000, 50000, 130000, '2024-04-30 12:05:33', 'COMPLETED', 0),
(144, 24, 5, 'RSV20250401-24', 80000, 50000, 130000, '2024-05-01 12:05:33', 'COMPLETED', 0),
(50, 25, 5, 'RSV20250401-25', 80000, 50000, 130000, '2024-05-05 12:05:33', 'COMPLETED', 0),
#26
(49, 26, 6, 'RSV20250401-26', 80000, 50000, 130000, '2024-05-03 12:05:33', 'COMPLETED', 0),
(49, 27, 5, 'RSV20250401-27', 80000, 50000, 130000, '2024-04-27 12:05:33', 'COMPLETED', 0),
(35, 28, 5, 'RSV20250401-28', 80000, 50000, 130000, '2025-04-28 12:05:33', 'SCHEDULED', 0),
(153, 29, 5, 'RSV20250401-29', 80000, 50000, 130000, '2025-04-29 12:05:33', 'SCHEDULED', 0),
(35, 30, 5, 'RSV20250401-30', 80000, 50000, 130000, '2025-04-30 12:05:33', 'SCHEDULED', 0),
#31
(35, 31, 6, 'RSV20250401-31', 80000, 50000, 130000, '2025-05-01 12:05:33', 'SCHEDULED', 0),
(76, 32, 6, 'RSV20250401-32', 80000, 50000, 130000, '2025-05-03 12:05:33', 'SCHEDULED', 0),
(144, 33, 6, 'RSV20250401-33', 80000, 50000, 130000, '2025-05-14 10:05:33', 'SCHEDULED', 0),
(153, 34, 6, 'RSV20250401-34', 80000, 50000, 130000, '2025-05-14 22:05:33', 'SCHEDULED', 0),
(76, 35, 6, 'RSV20250401-35', 80000, 50000, 130000, '2025-05-14 22:07:33', 'SCHEDULED', 0),
#36
(60, 36, 4, 'RSV20250401-36', 80000, 50000, 130000, '2025-05-21 12:05:33', 'SCHEDULED', 0),
(60, 37, 5, 'RSV20250401-37', 80000, 50000, 130000, '2025-05-21 13:05:33', 'SCHEDULED', 0),
(60, 38, 6, 'RSV20250401-38', 80000, 50000, 130000, '2025-05-21 14:05:33', 'SCHEDULED', 0),
(60, 39, 5, 'RSV20250401-39', 80000, 50000, 130000, '2025-05-21 14:06:33', 'SCHEDULED', 0),
(76, 40, 5, 'RSV20250401-40', 80000, 50000, 130000, '2025-05-18 12:05:33', 'SCHEDULED', 0),
#41
(153, 41, 5, 'RSV20250401-41', 80000, 50000, 130000, '2025-05-23 11:05:33', 'SCHEDULED', 0),
(60, 42, 4, 'RSV20250401-42', 80000, 50000, 130000, '2025-05-23 12:05:33', 'SCHEDULED', 0),
(60, 43, 5, 'RSV20250401-43', 80000, 50000, 130000, '2025-05-23 18:05:33', 'SCHEDULED', 0),
(19, 44, 5, 'RSV20250401-44', 80000, 50000, 130000, '2025-05-23 19:05:33', 'SCHEDULED', 0),
(153, 45, 6, 'RSV20250401-45', 80000, 50000, 130000, '2025-05-23 20:05:33', 'SCHEDULED', 0),
#46
(19, 46, 6, 'RSV20250401-46', 80000, 50000, 130000, '2025-05-26 01:05:33', 'SCHEDULED', 0),
(60, 47, 5, 'RSV20250401-47', 80000, 50000, 130000, '2025-05-26 02:05:33', 'SCHEDULED', 0),
(60, 48, 4, 'RSV20250401-48', 80000, 50000, 130000, '2025-05-26 10:05:33', 'SCHEDULED', 0),
(153, 49, 3, 'RSV20250401-49', 80000, 50000, 130000, '2025-05-26 11:05:33', 'SCHEDULED', 0),
(144, 50, 3, 'RSV20250401-50', 80000, 50000, 130000, '2025-05-27 12:05:33', 'SCHEDULED', 0);

INSERT INTO tbl_payment (member_code, order_code, payment_method, payment_brand, payment_time, payment_amount, payment_status, imp_uid, merchant_uid, receipt_url) VALUES
    (2, 1, 'CARD', '삼성카드', '2023-04-01 10:23:45', 240000, 'COMPLETED', 'imp_1234567890', 'RSV20250401-01', 'https://receipt.url/1'),
    (3, 2, 'CARD', '신한카드', '2023-04-02 14:10:12', 310000, 'COMPLETED', 'imp_1234567891', 'RSV20250401-02', 'https://receipt.url/2'),
    (4, 3, 'CARD', '국민카드', '2023-04-03 09:05:33', 130000, 'CANCELED', 'imp_1234567892', 'RSV20250401-03', 'https://receipt.url/3'),
    (5, 4, 'CARD', '롯데카드', '2023-04-03 10:05:33', 130000, 'COMPLETED', 'imp_1234567893', 'RSV20250401-04', 'https://receipt.url/4'),
    (6, 5, 'CARD', '우리카드', '2023-04-04 12:05:33', 130000, 'COMPLETED', 'imp_1234567894', 'RSV20250401-05', 'https://receipt.url/5'),
    (6, 6, 'CARD', '비씨카드', '2023-04-06 12:05:33', 130000, 'COMPLETED', 'imp_1234567895', 'RSV20250401-06', 'https://receipt.url/6');

INSERT INTO tbl_payment (member_code, order_code, payment_method, payment_brand, payment_time, payment_amount, payment_status, imp_uid, merchant_uid, receipt_url) VALUES
    (4, 7, 'CARD', '비씨카드', '2023-04-06 12:05:33', 130000, 'COMPLETED', 'imp_1234567896', 'RSV20250401-07', 'https://receipt.url/7'),
    (4, 8, 'CARD', '비씨카드', '2023-04-07 17:05:33', 130000, 'COMPLETED', 'imp_1234567897', 'RSV20250401-08', 'https://receipt.url/8'),
    (4, 9, 'CARD', '비씨카드', '2023-04-08 12:05:33', 130000, 'COMPLETED', 'imp_1234567898', 'RSV20250401-09', 'https://receipt.url/9'),
    # 10
    (4, 10, 'CARD', '비씨카드', '2023-04-09 12:05:33', 130000, 'CANCELED', 'imp_1234567899', 'RSV20250401-10', 'https://receipt.url/10'),
    (5, 11, 'CARD', '비씨카드', '2023-04-10 12:05:33', 130000, 'COMPLETED', 'imp_1234567900', 'RSV20250401-11', 'https://receipt.url/11'),
    (6, 12, 'CARD', '비씨카드', '2023-04-11 12:05:33', 130000, 'COMPLETED', 'imp_1234567901', 'RSV20250401-12', 'https://receipt.url/12'),
    (5, 13, 'CARD', '비씨카드', '2024-04-12 12:05:33', 130000, 'CANCELED', 'imp_1234567902', 'RSV20250401-13', 'https://receipt.url/13'),
    (2, 14, 'CARD', '비씨카드', '2024-04-13 12:05:33', 130000, 'COMPLETED', 'imp_1234567903', 'RSV20250401-14', 'https://receipt.url/14'),
    (4, 15, 'CARD', '비씨카드', '2024-04-14 12:05:33', 130000, 'COMPLETED', 'imp_1234567904', 'RSV20250401-15', 'https://receipt.url/15'),
    # 16
    (3, 16, 'CARD', '비씨카드', '2024-04-26 12:05:33', 130000, 'COMPLETED', 'imp_1234567905', 'RSV20250401-16', 'https://receipt.url/16');

INSERT INTO tbl_payment (member_code, order_code, payment_method, payment_brand, payment_time, payment_amount, payment_status, imp_uid, merchant_uid, receipt_url) VALUES
    (4, 17, 'CARD', '삼성카드', '2024-04-24 12:05:33', 130000, 'COMPLETED', 'imp_1234567910', 'RSV20250510-17', 'https://receipt.url/17'),
    (4, 18, 'CARD', '신한카드', '2024-04-25 12:05:33', 130000, 'COMPLETED', 'imp_1234567911', 'RSV20250611-18', 'https://receipt.url/18'),
    (4, 19, 'CARD', '국민카드', '2024-04-26 12:05:33', 130000, 'CANCELED', 'imp_1234567912', 'RSV20250712-19', 'https://receipt.url/19'),
    (4, 20, 'CARD', '롯데카드', '2024-04-27 12:05:33', 130000, 'COMPLETED', 'imp_1234567913', 'RSV20250813-20', 'https://receipt.url/20'),
    #21
    (5, 21, 'CARD', '우리카드', '2024-04-28 12:05:33', 130000, 'COMPLETED', 'imp_1234567914', 'RSV20250914-21', 'https://receipt.url/21'),
    (5, 22, 'CARD', '비씨카드', '2024-04-29 12:05:33', 130000, 'COMPLETED', 'imp_1234567915', 'RSV20251015-22', 'https://receipt.url/22'),
    (5, 23, 'CARD', '현대카드', '2024-04-30 12:05:33', 130000, 'COMPLETED', 'imp_1234567916', 'RSV20251116-23', 'https://receipt.url/23'),
    (5, 24, 'CARD', '하나카드', '2024-05-01 12:05:33', 130000, 'CANCELED', 'imp_1234567917', 'RSV20251217-24', 'https://receipt.url/24'),
    (5, 25, 'CARD', '롯데카드', '2024-05-05 12:05:33', 130000, 'COMPLETED', 'imp_1234567918', 'RSV20250518-25', 'https://receipt.url/25'),
    #26
    (6, 26, 'CARD', '우리카드', '2024-05-03 12:05:33', 130000, 'COMPLETED', 'imp_1234567919', 'RSV20250619-26', 'https://receipt.url/26'),
    (5, 27, 'CARD', '신한카드', '2024-04-27 12:05:33', 130000, 'COMPLETED', 'imp_1234567920', 'RSV20250720-27', 'https://receipt.url/27'),
    (5, 28, 'CARD', '신한카드', '2025-04-28 12:05:33', 130000, 'COMPLETED', 'imp_1234567921', 'RSV20250720-28', 'https://receipt.url/27'),
    (5, 29, 'CARD', '신한카드', '2025-04-29 12:05:33', 130000, 'COMPLETED', 'imp_1234567922', 'RSV20250720-29', 'https://receipt.url/27'),
    (5, 30, 'CARD', '신한카드', '2025-04-30 12:05:33', 130000, 'COMPLETED', 'imp_1234567923', 'RSV20250720-30', 'https://receipt.url/27'),
    #31
    (6, 31, 'CARD', '신한카드', '2025-05-01 12:05:33', 130000, 'COMPLETED', 'imp_1234567924', 'RSV20250720-31', 'https://receipt.url/27'),
    (6, 32, 'CARD', '신한카드', '2025-05-03 12:05:33', 130000, 'COMPLETED', 'imp_1234567925', 'RSV20250720-32', 'https://receipt.url/27'),
    (6, 33, 'CARD', '신한카드', '2025-05-14 10:05:33', 130000, 'COMPLETED', 'imp_1234567926', 'RSV20250720-33', 'https://receipt.url/27'),
    (6, 34, 'CARD', '신한카드', '2025-05-14 22:05:33', 130000, 'COMPLETED', 'imp_1234567927', 'RSV20250720-34', 'https://receipt.url/27'),
    (6, 35, 'CARD', '신한카드', '2025-05-14 22:07:33', 130000, 'COMPLETED', 'imp_1234567928', 'RSV20250720-35', 'https://receipt.url/27'),
    #36
    (4, 36, 'CARD', '신한카드', '2025-05-21 12:05:33', 130000, 'COMPLETED', 'imp_1234567929', 'RSV20250720-36', 'https://receipt.url/27'),
    (5, 37, 'CARD', '신한카드', '2025-05-21 13:05:33', 130000, 'COMPLETED', 'imp_1234567930', 'RSV20250720-37', 'https://receipt.url/27'),
    (6, 38, 'CARD', '신한카드', '2025-05-21 14:05:33', 130000, 'COMPLETED', 'imp_1234567931', 'RSV20250720-38', 'https://receipt.url/27'),
    (5, 39, 'CARD', '신한카드', '2025-05-21 14:06:33', 130000, 'COMPLETED', 'imp_1234567932', 'RSV20250720-39', 'https://receipt.url/27'),
    (5, 40, 'CARD', '신한카드', '2025-05-18 12:05:33', 130000, 'COMPLETED', 'imp_1234567933', 'RSV20250720-40', 'https://receipt.url/27'),
    #41
    (5, 41, 'CARD', '신한카드', '2025-05-23 11:05:33', 130000, 'COMPLETED', 'imp_1234567934', 'RSV20250720-41', 'https://receipt.url/27'),
    (4, 42, 'CARD', '신한카드', '2025-05-23 12:05:33', 130000, 'COMPLETED', 'imp_1234567935', 'RSV20250720-42', 'https://receipt.url/27'),
    (5, 43, 'CARD', '신한카드', '2025-05-23 18:05:33', 130000, 'COMPLETED', 'imp_1234567936', 'RSV20250720-43', 'https://receipt.url/27'),
    (5, 44, 'CARD', '신한카드', '2025-05-23 19:05:33', 130000, 'COMPLETED', 'imp_1234567937', 'RSV20250720-44', 'https://receipt.url/27'),
    (6, 45, 'CARD', '신한카드', '2025-05-23 20:05:33', 130000, 'COMPLETED', 'imp_1234567938', 'RSV20250720-45', 'https://receipt.url/27'),
    #46
    (6, 46, 'CARD', '신한카드', '2025-05-26 01:05:33', 130000, 'COMPLETED', 'imp_1234567939', 'RSV20250720-46', 'https://receipt.url/27'),
    (5, 47, 'CARD', '신한카드', '2025-05-26 02:05:33', 130000, 'COMPLETED', 'imp_1234567940', 'RSV20250720-47', 'https://receipt.url/27'),
    (4, 48, 'CARD', '신한카드', '2025-05-26 10:05:33', 130000, 'COMPLETED', 'imp_1234567941', 'RSV20250720-48', 'https://receipt.url/27'),
    (3, 49, 'CARD', '신한카드', '2025-05-26 11:05:33', 130000, 'COMPLETED', 'imp_1234567942', 'RSV20250720-49', 'https://receipt.url/27'),
    (3, 50, 'CARD', '신한카드', '2025-05-27 12:05:33', 130000, 'COMPLETED', 'imp_1234567943', 'RSV20250720-50', 'https://receipt.url/27');



INSERT INTO tbl_payment_cancel (payment_code, cancel_time, cancel_amount, pg_tid, cancel_receipt_url) VALUES
    (3, '2025-04-04 11:35:20', 130000, 'pg_cancel_9876543210', 'https://receipt.url/cancel/3'),
    (10, '2025-05-09 11:00:00', 130000, 'pg_cancel_1234567910', 'https://receipt.url/cancel/10'),
    (13, '2025-05-09 11:30:00', 130000, 'pg_cancel_1234567913', 'https://receipt.url/cancel/13'),
    (19, '2025-05-09 11:45:00', 240000, 'pg_cancel_1234567912', 'https://receipt.url/cancel/19'),
    (24, '2025-05-09 11:55:00', 280000, 'pg_cancel_1234567917', 'https://receipt.url/cancel/24');

INSERT INTO tbl_review (member_code, product_code, option_code, order_code, review_rating, review_content, review_date, review_pic, review_status) VALUES
    (4, 76, 3, 3, 5, '이탈리아학회 사람들과 단체로 방문하면서 구매했던건데 공홈보다 저렴해서 선택했습니다', '2023-05-21 14:30:00', 'IMG_2881.JPG', 'ACTIVE'),
    (3, 76, 2, 2, 1, NULL, '2023-05-22 09:15:00', NULL, 'DELETE_BY_ADMIN'),
    (2, 76, 1, 1, 3, '다리 아파요... 무릎 안좋으면 가지마셈ㅠ', '2023-05-23 09:15:00', NULL, 'ACTIVE'),
    (5, 76, 4, 4, 4, '존.잼. 석조 건축물은 정말 대단해요', '2023-05-23 10:15:00', NULL, 'ACTIVE'),
    (6, 76, 5, 5, 5, '이탈리아 학회 사람들과 다같이 구매했던건데 리뷰 남기는거 잊고 있다가 2년만에 접속했다가 리뷰 남겨요ㅎㅎ.', '2025-05-21 09:15:00', NULL, 'ACTIVE');

INSERT INTO tbl_review (member_code, product_code, option_code, order_code, review_rating, review_content, review_date, review_pic, review_status) VALUES
    (4, 70, 8, 8, 5, '정말 멋진 경험이었어요!', '2025-05-22 15:00:00', NULL, 'ACTIVE'),
    (4, 102, 9, 9, 5, '잊지 못할 추억을 만들었어요.', '2025-05-23 17:00:00', NULL, 'ACTIVE'),
    (5, 79, 11, 11, 4, '기대보다 더 좋았어요.', '2025-05-24 11:00:00', NULL, 'ACTIVE'),
    (6, 79, 12, 12, 5, '완벽한 여행이었어요.', '2025-05-24 16:00:00', NULL, 'ACTIVE'),
    (2, 79, 14, 14, 3, '그럭저럭 괜찮았어요.', '2025-05-24 16:10:00', NULL, 'ACTIVE'),
    (4, 76, 19, 19, 5, '정말 잊을 수 없는 추억이었어요.', '2025-05-25 17:00:00', NULL, 'ACTIVE');
COMMIT;